#include<iostream>
using namespace std;
int main()
{
	//一维数组定义方式
	/*
	* 数组特点：
	* 1.放在一块连续的内存空间中
	* 2.数组中每个元素都是相同类型
	* 
	* 注意：数组下标从0开始
	*/
	/*
	* 方法1：
	* 数据类型 数组名[ 数组长度 ];
	* 
	* 方法2：
	* 数组类型 数组名[ 数组长度 ] = { 值1, 值2, ... };
	* 
	* 方法3：
	* 数组类型 数组名[  ] = { 值1, 值2, ... };
	*/

	//1.数据类型 数组名[ 数组长度 ];
	int arr[5];
	//对数组中的元素赋值
	arr[0] = 10;
	arr[1] = 20;
	arr[2] = 30;
	arr[3] = 40;
	arr[4] = 50;
	//访问数组元素
	cout << arr[0] << endl;
	cout << arr[1] << endl;
	cout << arr[2] << endl;
	cout << arr[3] << endl;
	cout << arr[4] << endl;
	cout << "--------------------------------------------" << endl;
	//2.数组类型 数组名[ 数组长度 ] = { 值1, 值2, ... };
	//在初始化数据时，若没有填写完整，会用0填充剩余的数据
	int arr2[5] = { 10,20,30 };
	//用循环的方式输出数组
	for (int i = 0; i < 5; i++)
	{
		cout << arr2[i] << endl;
	}
	cout << "--------------------------------------------" << endl;
	//3.数组类型 数组名[  ] = { 值1, 值2, ... };
	//定义数组时，必须有初始长度
	int arr3[] = { 90,80,70,60,50,40,30,20,10 };
	for (int a = 0; a < 9; a++)
	{
		cout << arr3[a] << endl;
	}
	system("pause");
	return 0;
}