#include<iostream>
using namespace std;
int main()
{
	//二维数组定义方式
	/*
	* 1.数据类型 数组名[行数][列数];
	* 2.数据类型 数组名[行数][列数]={{数据1,数据2},{数据3,数据4}};
	* 3.数据类型 数组名[行数][列数]={数据1,数据2,数据3,数据4};
	* 4.数据类型 数组名[ ][列数]={数据1,数据2,数据3,数据4};
	*/
	//方法2最直观

	//1.数据类型 数组名[行数][列数];
	int arr[2][3];
	arr[0][0] = 0;
	arr[0][1] = 1;
	arr[0][2] = 2;
	arr[1][0] = 3;
	arr[1][1] = 4;
	arr[1][2] = 5;
	for (int a = 0; a < 2; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			cout << arr[a][b] << " ";
		}
		cout << endl;
	}
	cout << endl;
	cout << "-----------------------------" << endl;
	//2.数据类型 数组名[行数][列数]={{数据1,数据2},{数据3,数据4}};
	int arr2[2][3] =
	{
		{1,2,3},
		{4,5,6}
	};
	for (int a = 0; a < 2; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			cout << arr2[a][b] << " ";
		}
		cout << endl;
	}
	cout << endl;
	cout << "-----------------------------" << endl;
	//3.数据类型 数组名[行数][列数]={数据1,数据2,数据3,数据4};
	int arr3[2][3] = { 1,2,3,4,5,6 };
	for (int a = 0; a < 2; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			cout << arr3[a][b] << " ";
		}
		cout << endl;
	}
	cout << endl;
	cout << "-----------------------------" << endl;
	//4.数据类型 数组名[ ][列数]={数据1,数据2,数据3,数据4};
	int arr4[][3] = { 1,2,3,4,5,6 };
	for (int a = 0; a < 2; a++)
	{
		for (int b = 0; b < 3; b++)
		{
			cout << arr4[a][b] << " ";
		}
		cout << endl;
	}
	cout << endl;
	system("pause");
	return 0;
}